#include "salesanalysis.h"

SalesAnalysis::SalesAnalysis()
{

}

QString SalesAnalysis::getZnach(){
    const int n=60;
    //Индексная переменная:
    int i;
    //Массивы статистических значений:
    //объем продаж в рублях за каждый месяц
    double y[n]={  17986229,
                   23571965,
                   25537589,
                   24630951,
                   24429696,
                   26116377,
                   27931501,
                   25914893,
                   24904130,
                   22360354,
                   23825299,
                   22241744,
                   21149853,
                   23770186,
                   29608386,
                   28588548,
                   29712036,
                   31191793,
                   28311730,
                   27438262,
                   26166319,
                   25916207,
                   23168086,
                   27707909,
                   25379305,
                   27823570,
                   28518039,
                   33971886,
                   31577081,
                   29328611,
                   34312920,
                   31364478,
                   29046432,
                   27244171,
                   24353446,
                   25447525,
                   24255101,
                   22391876,
                   27902911,
                   24102028,
                   24939643,
                   25401741,
                   22817314,
                   23554471,
                   21219769,
                   21144903,
                   19185427,
                   20507490,
                   16116508,
                   20363081,
                   24924310,
                   23881278,
                   24039243,
                   29292943,
                   25244289,
                   26986987,
                   26856798,
                   27051059,
                   23474916,
                   32610182

};
    //номер месяца
    double x[n]={1,
                 2,
                 3,
                 4,
                 5,
                 6,
                 7,
                 8,
                 9,
                 10,
                 11,
                 12,
                 13,
                 14,
                 15,
                 16,
                 17,
                 18,
                 19,
                 20,
                 21,
                 22,
                 23,
                 24,
                 25,
                 26,
                 27,
                 28,
                 29,
                 30,
                 31,
                 32,
                 33,
                 34,
                 35,
                 36,
                 37,
                 38,
                 39,
                 40,
                 41,
                 42,
                 43,
                 44,
                 45,
                 46,
                 47,
                 48,
                 49,
                 50,
                 51,
                 52,
                 53,
                 54,
                 55,
                 56,
                 57,
                 58,
                 59,
                 60

};
    //Параметры модели:
   long double a,b;
    //Средние значения:
    double Sx=0,Sy=0,Sxy=0,Sxx=0;

    //Вычисление параметров модели:
    for(i=0; i < n; i++){
     Sx+=x[i];
     Sy+=y[i];
     Sxy+=x[i]*y[i];
     Sxx+=x[i]*x[i];
    }
    Sx/=n;
    Sy/=n;
    Sxy/=n;
    Sxx/=n;
    a=(Sx*Sy-Sxy)/(Sx*Sx-Sxx);
    b=(Sxy-a*Sxx)/Sx;
   // qDebug()<<a;
    //qDebug()<<b;
    QString st=QString::number(a,'d',5)+","+QString::number(b,'f',5)+"\n";
    QString ss="Отклонение знач.";
    st+="Месяц         Продажи руб.         Значения тренда         "+ss+"        Среднее отклонение \n";
    //Значения тренда
    double ztr[n];
    for(int i=0;i<n;i++){
        ztr[i]=a*(i+1)+b;
    }

    //Отклонение фактических значений от значений тренда
    double zt[n];
    for(int i=0;i<n;i++){
        zt[i]=y[i]/(a*(i+1)+b);
    }

   //Среднее отклонение для каждого месяца
     double g[12];
     int k=0;
     while(k<12){
         int t=k;
         int kol=0;
        while(t<n){
            g[k]+=zt[t];
            kol++;
            t+=12;
        }
        g[k]/=kol;
         k++;
     }
     for(int i=0;i<12;i++){
       //   qDebug()<<g[i];
     }
     //Общий индекс сезонности
     double sr=0;
     for(int i=0;i<12;i++){
          sr+=g[i];
     }
     sr=sr/12;
  //   qDebug()<<"Общий индекс сезонности:"<<sr;
    // Коэффициенты сезонности очищенные от роста
     double ghy[12];
     for(int i=0;i<12;i++){
          ghy[i]=g[i]/sr;
     //    qDebug()<<ghy[i];
     }

     for(int i=0;i<n;i++){
         st+=QString::number(i)+"              "+QString::number(y[i],'d',5)+"           "+QString::number(ztr[i],'d',5)+"                "+QString::number(zt[i],'d',5)+"\n";
     }




    return st;

    //Результат:
    //cout << "a = " << a << endl;
    //cout << "b = " << b << endl;
}

